{"_id":{"$oid":"5c0927b027cfbc2da4fddc5a"},"cities":["cartagena"],"hasDigitalCopy":false,"copies":[785,164,759,645,1000],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc5b"},"isbn":9.781451648546e+12,"title":"steve jobs","author":"walter isaacson","year":2011,"description":"Draws on more than forty interviews with Steve Jobs, as well as interviews with family members, friends, competitors, and colleagues to offer a look at the co-founder and leading creative force behind the Apple computer company.","numPages":630,"image":"http://books.google.com/books/content?id=8U2oAAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c092cbda22a5c2494694abe"},"userEmail":"jobman@jobman.com","bookCode":785,"lendDate":{"$date":"2018-12-06T14:05:49.140Z"},"limitDate":{"$date":"2018-12-14T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc5c"},"cities":["quito"],"hasDigitalCopy":true,"copies":[773,185],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc5d"},"isbn":9.781454921356e+12,"title":"poe coloring book","author":"odessa begay","year":2016,"description":"Dive into the macabre, mysterious world of Edgar Allan Poe's chilling tales with popular coloring book artist Odessa Begay (Little Birds). Inspired by Poe's beloved stories, Begay has created images that reference settings, motifs, and details that fans will recognize.","numPages":96,"image":"http://books.google.com/books/content?id=RURljwEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c09435b0809a73d50f4aff1"},"userEmail":"jobman@jobman.com","bookCode":773,"lendDate":{"$date":"2018-12-06T15:42:19.716Z"},"limitDate":{"$date":"2018-12-12T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc5e"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[722,387,140,149,559,578,916,363,910,136],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc5f"},"isbn":9.780804172448e+12,"title":"station eleven","author":"emily st. john mandel","year":2015,"description":"A National Book Award Finalist A PEN/Faulkner Award Finalist Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end. Twenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band's existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed.","numPages":352,"image":"http://books.google.com/books/content?id=AQzRrQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c092911a22a5c2494694a98"},"userEmail":"jobman@jobman.com","bookCode":722,"lendDate":{"$date":"2018-12-06T13:50:09.472Z"},"limitDate":{"$date":"2018-12-11T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc60"},"cities":["quito"],"hasDigitalCopy":false,"copies":[119,130,631,160,834,699,664,137,1066],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc61"},"isbn":9.780131103627e+12,"title":"the c programming language","author":"brian w. kernighan","year":1988,"description":"Introduces the features of the C programming language, discusses data types, variables, operators, control flow, functions, pointers, arrays, and structures, and looks at the UNIX system interface","numPages":272,"image":"http://books.google.com/books/content?id=161QAAAAMAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc62"},"cities":["medellin"],"hasDigitalCopy":true,"copies":[411,826,832,617],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc63"},"isbn":9.781567925968e+12,"title":"on heroes and tombs","author":"ernesto sabato","year":2017,"description":"Godine first published this towering work of Latin American literature in 1981, to a front page New York Times review. Now reissued in softcover with a new introduction, the book, often mentioned in the same breath as Borges, was praised by Camus and writers as various as Thomas Mann, Graham Greene, Pablo Neruda, Salman Rushdie, and Colm Tóibin. Sabato was an important political figure as well as a novelist, exposing the state terrorism of Argentina's \"dirty war\" while writing about everything from metaphysics to tango. On Heroes and Tombs is his masterpiece. In his obituary in 2011, the New York Times wrote, \"In 1972, the Chilean poet Pablo Neruda listed Mr. Sabato among the Latin American writers who displayed 'greater vitality and imagination than anything since the great Russian novels' of the 19th century. On Heroes and Tombs, the story of a young man trying to find his way in life in Buenos Aires, is considered his most important work of fiction. But many people also know Mr. Sabato for his work in helping Argentina heal when democracy was restored in 1983 after seven years of military dictatorship.\" This book is woven around a violent crime: the scion of a prominent Argentinian family, Alejandra, shoots her father and burns herself alive over his corpse. The story shifts between perspectives to reveal the lives of those closest to her, telling of Martin, her troubled lover; Bruno, a writer who loved her mother; and Fernando, her father, who believes himself hunted by a secret, international organization of the blind. Exploring the tumult of Buenos Awes in the 1950s, Heroes illuminates its characters against burning churches and corporate greed. An examination of Argentinian history and culture, it reveals the country at every level, leading its reader into a world of passion, philosophy, and paranoia that still persists. Book jacket.","numPages":480,"image":"http://books.google.com/books/content?id=8odKMQAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c0927c1bb7aee14ec2b5276"},"userEmail":"jobman@jobman.com","bookCode":411,"lendDate":{"$date":"2018-12-06T13:44:33.800Z"},"limitDate":{"$date":"2018-12-18T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc64"},"cities":["quito"],"hasDigitalCopy":true,"copies":[785,513,308,1065],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc65"},"isbn":9.781492044635e+12,"title":"programming ios 12","author":"matt neuburg","year":2018,"description":"If you're grounded in the basics of Swift, Xcode, and the Cocoa framework, this book provides a structured explanation of all essential real-world iOS app components. Through deep exploration and copious code examples, you'll learn how to create views, manipulate view controllers, and add features from iOS frameworks. Create, arrange, draw, layer, and animate views that respond to touch Use view controllers to manage multiple screens of interface Master interface classes for scroll views, table views, text, popovers, split views, web views, and controls Dive into frameworks for sound, video, maps, and sensors Access user libraries: music, photos, contacts, and calendar Explore additional topics, including files, networking, and threads Stay up-to-date on iOS 12 innovations, such as User Notification framework improvements, as well as changes in Xcode 10 and Swift 4.2. All example code is available on GitHub for you to download, study, and run. Want to brush up on the basics? Pick up iOS 12 Programming Fundamentals with Swift to learn about Swift, Xcode, and Cocoa. Together with Programming iOS 12, you'll gain a solid, rigorous, and practical understanding of iOS 12 development.","numPages":1178,"image":"http://books.google.com/books/content?id=8GClugEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c0943500809a73d50f4afd7"},"userEmail":"jobman@jobman.com","bookCode":785,"lendDate":{"$date":"2018-12-06T15:42:08.510Z"},"limitDate":{"$date":"2018-12-17T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc66"},"cities":["cartagena"],"hasDigitalCopy":false,"copies":[297,243],"bookinfo":{"rating":3,"_id":{"$oid":"5c0927b027cfbc2da4fddc67"},"isbn":9.780387310732e+12,"title":"pattern recognition and machine learning","author":"christopher m. bishop","year":2006,"description":"This is the first text on pattern recognition to present the Bayesian viewpoint, one that has become increasing popular in the last five years. It presents approximate inference algorithms that permit fast approximate answers in situations where exact answers are not feasible. It provides the first text to use graphical models to describe probability distributions when there are no other books that apply graphical models to machine learning. It is also the first four-color book on pattern recognition. The book is suitable for courses on machine learning, statistics, computer science, signal processing, computer vision, data mining, and bioinformatics. Extensive support is provided for course instructors, including more than 400 exercises, graded according to difficulty. Example solutions for a subset of the exercises are available from the book web site, while solutions for the remainder can be obtained by instructors from the publisher.","numPages":738,"image":"http://books.google.com/books/content?id=qWPwnQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc68"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[335,321,266],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc69"},"isbn":9.780439064866e+12,"title":"harry potter and the chamber of secrets (book 2)","author":"rowling, j.k.","year":2015,"description":"In Harry Potter and the Chamber of Secrets, the summer after Harry’s first year at Hogwarts has been his worst summer ever… the Dursleys more distant and horrible than ever before. But just as he’s packing his bags to return to school, a creature named Dobby the house-elf announces that if Harry goes back to Hogwarts, disaster will strike. And it turns out, Dobby is right. Harry and Ron miss the Hogwarts Express, so they fly to school in a blue Ford Anglia, crash landing in the notorious Whomping Willow. Soon other worries accumulate: the outrageously stuck-up new professor Gilderoy Lockhart; a ghost named Moaning Myrtle, who haunts the girls' bathroom; the strange behavior of Ron's little sister, Ginny Weasley; rumors about the \"Chamber of Secrets,\" a cavern buried deep below Hogwarts; and a magical diary owned by Tom Riddle, a Hogwarts student of long ago. Harry is also shocked to discover that he can speak Parseltongue, the language of snakes - a rare ability that Lord Voldemort also possessed - and that anti-Muggle prejudice exists in the Wizarding world, even affecting Harry's friend Hermione. But all of these seem like minor concerns when someone starts turning Hogwarts students to stone: an evildoer said to be the fearsome Heir of Salazar Slytherin, on of the founders of the school. Could it be Draco Malfoy, Harry's most poisonous rival? Could it be Hagrid whose mysterious past is finally told? Or could it be the one person everyone at Hogwarts most suspects: Harry Potter himself?","numPages":341,"image":"http://books.google.com/books/content?id=ZTE0BgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c092852a22a5c24946948ec"},"userEmail":"jobman@jobman.com","bookCode":335,"lendDate":{"$date":"2018-12-06T13:46:58.393Z"},"limitDate":{"$date":"2018-12-19T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc6a"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[576,794,1079,837,920,742,576,120],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc6b"},"isbn":9.780802123701e+12,"title":"euphoria","author":"lily king","year":2015,"description":"English anthropologist Andrew Banson has been alone in the field for several years, studying the Kiona river tribe in 1930s New Guinea. Haunted by the memory of his brothers' deaths and increasingly frustrated and isolated by his research, Bankson is on the verge of suicide. Then he encounters the famous and controversial American anthropologist Nell Stone and her wry and mercurial Australian husband, Fen, who have just fled the bloodthirsty Mumbanyo. Nell and Fen and, in spite of Nell's poor health, are hungry for a new discovery. When Bankson finds them a new tribe nearby, the artistic, female-dominated Tam, he ignites an intellectual and romantic firestorm between the three of them that burns out of anyone's control.","numPages":288,"image":"http://books.google.com/books/content?id=5ry-oQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc6c"},"cities":["medellin","quito"],"hasDigitalCopy":true,"copies":[787,340,622,751,288,129,557],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc6d"},"isbn":9.780439139601e+12,"title":"harry potter and the goblet of fire (book 4)","author":"rowling, j.k.","year":2015,"description":"In Harry Potter and the Goblet of Fire, Harry is midway through both his training as a wizard and his coming of age. He wants to get away from the malicious Dursleys and go to the Quidditch World Cup with Hermione, Ron, and the Weasleys. He wants to dream about his crush, Cho Chang (and maybe do more than dream). And now that he’s gotten the hang of things at Hogwarts—he hopes—he just wants to be a normal fourteen-year-old wizard. But even by his standards, Harry's year is anything but normal. First Dumbledore announces the revival of a grand competition that hasn't taken place for one hundred years: the Triwizard Tournament, where a Hogwarts champion will compete against rivals from two other schools of magic in three highly dangerous tasks. Then someone frames Harry to participate in the tournament—which really means someone wants him dead. Harry is guided through the competition by Professor Alastor Moody, this year's Defense Against the Dark Arts teacher, but he must also contend with a nasty reporter named Rita Skeeter, who digs up some highly unflattering secrets about Hagrid; a terrible fight with Ron, who is deeply jealous of Harry's fame; Hermione's newfound activism on behalf of house-elves; and the terrifying prospect of asking a date to the Yule Ball. Worst of all, Lord Voldemort may finally have gathered the materials necessary for his rejuvenation... and he has a faithful servant at Hogwarts waiting only for a sign. No, nothing is ever normal for Harry Potter. And in his case, different can be deadly.","numPages":734,"image":"http://books.google.com/books/content?id=-TE0BgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c09287aa22a5c2494694919"},"userEmail":"jobman@jobman.com","bookCode":787,"lendDate":{"$date":"2018-12-06T13:47:38.744Z"},"limitDate":{"$date":"2018-12-12T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc6e"},"cities":["quito"],"hasDigitalCopy":false,"copies":[599,210,704,834,1080,766],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc6f"},"isbn":9.780547154114e+12,"title":"tales from the perilous realm","author":"john ronald reuel tolkien","year":1997,"description":"Never before published in a single volume, Tolkien's four novellas (\"Farmer Giles of Ham, Leaf by Niggle, Smith of Wootton Major,\" and \"Roverandom\") and one book of poems (\"The Adventures of Tom Bombadil\") are gathered together in a fully illustrated set.","numPages":403,"image":"http://books.google.com/books/content?id=7GNfxfH0ZU4C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc70"},"cities":["medellin","quito"],"hasDigitalCopy":false,"copies":[1024],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc71"},"isbn":9.780439136365e+12,"title":"the prisoner of azkaban","author":"j. k. rowling","year":1999,"description":"During his third year at Hogwarts School for witchcraft and wizardry, Harry Potter must confront the devious and dangerous wizard responsable for his parents death.","numPages":435,"image":"http://books.google.com/books/content?id=p-W7qWMJUasC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc72"},"cities":["medellin","cartagena"],"hasDigitalCopy":false,"copies":[908],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc73"},"isbn":9.780785814535e+12,"title":"edgar allan poe complete tales and poems","author":"edgar allan poe","year":2009,"description":"The life of American writer Edgar Allan Poe was characterized by a dramatic series of successes and failures, breakdowns and recoveries, personal gains and hopes dashed through, despite which he created some of the finest literature the world has ever known. Over time his works have influenced such major creative forces as the French poets Charles Baudelaire and Andre Gide, filmmaker D.W. Griffith and modern literary legend Allen Ginsberg. Best known for his poems and short fiction, Poe perfected the psychological thriller, invented the detective story, and rarely missed transporting the reader to his own supernatural realm. He has also been hailed posthumously as one of the finest literary critics of the nineteenth century. In Edgar Allan Poe: Complete Tales and Poems fans may indulge in all of Poe's most imaginative short-stories, including The Fall of the House of Usher, The Murders in Rue Morgue, The Tell-Tale Heart, Ligeia and Ms. In a Bottle. His complete early and miscellaneous poetic masterpieces are here also, including The Raven, Ulalume, Annabel Lee, Tamerlane, as well as select reviews and narratives.","numPages":842,"image":"http://books.google.com/books/content?id=uY4NAAAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc74"},"cities":["quito"],"hasDigitalCopy":true,"copies":[124,542,589,255,1002,222],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc75"},"isbn":9.78081297401e+12,"title":"black swan green","author":"david mitchell","year":2007,"description":"A meditative novel of a young boy on the cusp of adulthood follows a single year in the life of thirteen-year-old Jason Taylor as he grows up in what is for him the sleepiest village in Worcestershire, England, in 1982. By the aauthor of Cloud Atlas. Reprint. 75,000 first printing.","numPages":294,"image":"http://books.google.com/books/content?id=deDTTheTbPsC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc76"},"cities":["medellin"],"hasDigitalCopy":true,"copies":[638,517,189],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc77"},"isbn":9.781119049104e+12,"title":"starting a business all-in-one for dummies","author":"consumer dummies","year":2015,"description":"Starting a Business All-In-One For Dummies will give you the practical advice you need to start any type of business. The content will reflect today’s opportunities and challenges, managing your personal and business risks, and how to successfully navigate your first year in business, including branding and marketing. Learn to start up your dream business from scratch, write a winning business plan, secure financing, manage your risks successfully, navigate your first year of operation, and much more!","numPages":640,"image":"http://books.google.com/books/content?id=QUjjBwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc78"},"cities":["quito"],"hasDigitalCopy":false,"copies":[335,1076,758,396,970,865],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b027cfbc2da4fddc79"},"isbn":9.781617294433e+12,"title":"deep learning with python","author":"francois chollet","year":2017,"description":"Summary Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher Fran�ois Chollet, this book builds your understanding through intuitive explanations and practical examples. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology Machine learning has made remarkable progress in recent years. We went from near-unusable speech and image recognition, to near-human accuracy. We went from machines that couldn't beat a serious Go player, to defeating a world champion. Behind this progress is deep learning--a combination of engineering advances, best practices, and theory that enables a wealth of previously impossible smart applications. About the Book Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher Fran�ois Chollet, this book builds your understanding through intuitive explanations and practical examples. You'll explore challenging concepts and practice with applications in computer vision, natural-language processing, and generative models. By the time you finish, you'll have the knowledge and hands-on skills to apply deep learning in your own projects. What's Inside Deep learning from first principles Setting up your own deep-learning environment Image-classification models Deep learning for text and sequences Neural style transfer, text generation, and image generation About the Reader Readers need intermediate Python skills. No previous experience with Keras, TensorFlow, or machine learning is required. About the Author Fran�ois Chollet works on deep learning at Google in Mountain View, CA. He is the creator of the Keras deep-learning library, as well as a contributor to the TensorFlow machine-learning framework. He also does deep-learning research, with a focus on computer vision and the application of machine learning to formal reasoning. His papers have been published at major conferences in the field, including the Conference on Computer Vision and Pattern Recognition (CVPR), the Conference and Workshop on Neural Information Processing Systems (NIPS), the International Conference on Learning Representations (ICLR), and others. Table of Contents PART 1 - FUNDAMENTALS OF DEEP LEARNING What is deep learning? Before we begin: the mathematical building blocks of neural networks Getting started with neural networks Fundamentals of machine learning PART 2 - DEEP LEARNING IN PRACTICE Deep learning for computer vision Deep learning for text and sequences Advanced deep-learning best practices Generative deep learning Conclusions appendix A - Installing Keras and its dependencies on Ubuntu appendix B - Running Jupyter notebooks on an EC2 GPU instance","numPages":384,"image":"http://books.google.com/books/content?id=Yo3CAQAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc7a"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[958,746],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc7b"},"isbn":9.780123742605e+12,"title":"an introduction to parallel programming","author":"peter s. pacheco","year":2011,"description":"Author Peter Pacheco uses a tutorial approach to show students how to develop effective parallel programs with MPI, Pthreads, and OpenMP. The first undergraduate text to directly address compiling and running parallel programs on the new multi-core and cluster architecture, An Introduction to Parallel Programming explains how to design, debug, and evaluate the performance of distributed and shared-memory programs. User-friendly exercises teach students how to compile, run and modify example programs. Key features: Takes a tutorial approach, starting with small programming examples and building progressively to more challenging examples Focuses on designing, debugging and evaluating the performance of distributed and shared-memory programs Explains how to develop parallel programs using MPI, Pthreads, and OpenMP programming models","numPages":370,"image":"http://books.google.com/books/content?id=YmNwlAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc7c"},"cities":["medellin","quito","cartagena"],"hasDigitalCopy":false,"copies":[148],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc7d"},"isbn":9.780618212903e+12,"title":"the lord of the rings","author":"gary russell","year":2002,"description":"More than five hundred images, ranging from the earliest pencil sketches and conceptual drawings to paintings and film stills, document the art and artistry of the film \"The Lord of the Rings, the Fellowship of the Ring.\"","numPages":192,"image":"http://books.google.com/books/content?id=js_tNwAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc7e"},"cities":["medellin"],"hasDigitalCopy":false,"copies":[407,890],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc7f"},"isbn":9.780060883287e+12,"title":"one hundred years of solitude","author":"gabriel garcia marquez","year":2006,"description":"One Hundred Years of Solitude tells the story of the rise and fall, birth and death of the mythical town of Macondo through the history of the Buendía family. Inventive, amusing, magnetic, sad, and alive with unforgettable men and women -- brimming with truth, compassion, and a lyrical magic that strikes the soul -- this novel is a masterpiece in the art of fiction.","numPages":448,"image":"http://books.google.com/books/content?id=Rtk8PgAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c09283fa22a5c24946948d8"},"userEmail":"jobman@jobman.com","bookCode":407,"lendDate":{"$date":"2018-12-06T13:46:39.664Z"},"limitDate":{"$date":"2018-12-08T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc80"},"cities":["cartagena"],"hasDigitalCopy":false,"copies":[413,907,391],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc81"},"isbn":9.781501173219e+12,"title":"all the light we cannot see","author":"anthony doerr","year":2017,"description":"\"From the highly acclaimed, multiple award-winning Anthony Doerr, a stunningly ambitious and beautiful novel about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. Marie Laure lives with her father in Paris within walking distance of the Museum of Natural History where he works as the master of the locks (there are thousands of locks in the museum). When she is six, she goes blind, and her father builds her a model of their neighborhood, every house, every manhole, so she can memorize it with her fingers and navigate the real streets with her feet and cane. When the Germans occupy Paris, father and daughter flee to Saint-Malo on the Brittany coast, where Marie-Laure's agoraphobic great uncle lives in a tall, narrow house by the sea wall. In another world in Germany, an orphan boy, Werner, grows up with his younger sister, Jutta, both enchanted by a crude radio Werner finds. He becomes a master at building and fixing radios, a talent that wins him a place at an elite and brutal military academy and, ultimately, makes him a highly specialized tracker of the Resistance. Werner travels through the heart of Hitler Youth to the far-flung outskirts of Russia, and finally into Saint-Malo, where his path converges with Marie-Laure. Doerr's gorgeous combination of soaring imagination with observation is electric. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, All the Light We Cannot See is his most ambitious and dazzling work\"--","numPages":544,"image":"http://books.google.com/books/content?id=giaLDgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc82"},"cities":["quito"],"hasDigitalCopy":true,"copies":[104,1018,989,410],"bookinfo":{"rating":3.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc83"},"isbn":9.780451531391e+12,"title":"the inferno","author":"dante alighieri","year":2009,"description":"In the first part of Dante's epic poem about the three realms of the Christian afterlife, a spiritual pilgrim is led by Virgil through the nine circles of Hell.","numPages":296,"image":"http://books.google.com/books/content?id=dxFrpwAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[{"_id":{"$oid":"5c092d09a22a5c2494694ae5"},"userEmail":"jobman@jobman.com","bookCode":104,"lendDate":{"$date":"2018-12-06T14:07:05.228Z"},"limitDate":{"$date":"2018-12-12T05:00:00.000Z"}}],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc84"},"cities":["medellin"],"hasDigitalCopy":false,"copies":[956,188,1066,568],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc85"},"isbn":9.78159327599e+12,"title":"automate the boring stuff with python","author":"al sweigart","year":2015,"description":"If you’ve ever spent hours renaming files or updating hundreds of spreadsheet cells, you know how tedious tasks like these can be. But what if you could have your computer do them for you? In Automate the Boring Stuff with Python, you’ll learn how to use Python to write programs that do in minutes what would take you hours to do by hand—no prior programming experience required. Once you’ve mastered the basics of programming, you’ll create Python programs that effortlessly perform useful and impressive feats of automation to: Search for text in a file or across multiple filesCreate, update, move, and rename files and foldersSearch the Web and download online contentUpdate and format data in Excel spreadsheets of any sizeSplit, merge, watermark, and encrypt PDFsSend reminder emails and text notificationsFill out online forms Step-by-step instructions walk you through each program, and practice projects at the end of each chapter challenge you to improve those programs and use your newfound skills to automate similar tasks. Don’t spend your time doing work a well-trained monkey could do. Even if you’ve never written a line of code, you can make your computer do the grunt work. Learn how in Automate the Boring Stuff with Python. Note: The programs in this book are written to run on Python 3.","numPages":504,"image":"http://books.google.com/books/content?id=UEu0CAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc86"},"cities":["medellin","quito","cartagena"],"hasDigitalCopy":true,"copies":[254,488,362],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc87"},"isbn":9.780132350884e+12,"title":"clean code","author":"robert c. martin","year":2009,"description":"Looks at the principles and clean code, includes case studies showcasing the practices of writing clean code, and contains a list of heuristics and \"smells\" accumulated from the process of writing clean code.","numPages":431,"image":"http://books.google.com/books/content?id=hjEFCAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc88"},"cities":["cartagena"],"hasDigitalCopy":false,"copies":[498,325,285,805],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b027cfbc2da4fddc89"},"isbn":9.781593276034e+12,"title":"python crash course","author":"eric matthes","year":2015,"description":"Learn Python—Fast! Python Crash Course is a fast-paced, thorough introduction to Python that will have you writing programs, solving problems, and making things that work in no time. In the first half of the book, you’ll learn about basic programming concepts, such as lists, dictionaries, classes, and loops, and practice writing clean and readable code with exercises for each topic. You’ll also learn how to make your programs interactive and how to test your code safely before adding it to a project. In the second half of the book, you’ll put your new knowledge into practice with three substantial projects: a Space Invaders–inspired arcade game, data visualizations with Python’s super-handy libraries, and a simple web app you can deploy online. As you work through Python Crash Course you’ll learn how to: *Use powerful Python libraries and tools, including matplotlib, NumPy, and Pygal *Make 2D games that respond to keypresses and mouse clicks, and that grow more difficult as the game progresses *Work with data to generate interactive visualizations *Create and customize Web apps and deploy them safely online *Deal with mistakes and errors so you can solve your own programming problems If you’ve been thinking seriously about digging into programming, Python Crash Course will get you up to speed and have you writing real programs fast. Why wait any longer? Start your engines and code! Uses Python 2 and 3","numPages":560,"image":"http://books.google.com/books/content?id=RXoZCwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc8a"},"cities":["medellin"],"hasDigitalCopy":true,"copies":[977,443,913,752],"bookinfo":{"rating":3.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc8b"},"isbn":9.78147677039e+12,"title":"revival","author":"stephen king","year":2015,"description":"\"The new minister came to Harlow, Maine, when Jamie Morton was a boy doing a battle with his toy army men on the front lawn. The young Reverend Charles Jacobs and his beautiful wife brought new life to the local church and captivated their congregation. But with Jamie, he shares a secret obsession - a draw so powerful, it would have profound consequences five decades after the shattering tragedy that turned the preacher against God, and long after his final, scathing sermon. Now Jamie, a nomadic rock guitarist hooked on heroin, meets Charles Jacobs again. And when their bond becomes a pact beyond even the Devil's devising, Jamie discovers that revival has many meanings\"--Back cover.","numPages":416,"image":"http://books.google.com/books/content?id=VLW2CAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc8c"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[555],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc8d"},"isbn":9.7805451397e+12,"title":"harry potter and the deathly hallows (book 7)","author":"rowling, j.k.","year":2015,"description":"In Harry Potter and the Deathly Hallows, the seventh and final book in the epic tale of Harry Potter, Harry and Lord Voldemort each prepare for their ultimate encounter. Voldemort takes control of the Ministry of Magic, installs Severus Snape as headmaster at Hogwarts, and sends his Death Eaters across the country to wreak havoc and find Harry. Meanwhile, Harry, Ron, and Hermione embark on a desperate quest the length and breadth of Britain, trying to locate and destroy Voldemort’s four remaining Horcruxes, the magical objects in which he has hidden parts of his broken soul. They visit the Burrow, Grimmauld Place, the Ministry, Godric’s Hollow, Malfoy Manor, Diagon Alley…But every time they solve one mystery, three more evolve—and not just about Voldemort, but about Dumbledore, and Harry’s own past, and three mysterious objects called the Deathly Hallows. The Hallows are literally things out of a children’s tale, which, if real, promise to make their possessor the “Master of Death;” and they ensnare Harry with their tantalizing claim of invulnerability. It is only after a nigh-unbearable loss that he is brought back to his true purpose, and the trio returns to Hogwarts for the final breathtaking battle between the forces of good and evil. They fight the Death Eaters alongside members of the Order of the Phoenix, Dumbledore’s Army, the Weasley clan, and the full array of Hogwarts teachers and students. Yet everything turns upon the moment the entire series has been building up to, the same meeting with which our story began: the moment when Harry and Voldemort face each other at last.","numPages":759,"image":"http://books.google.com/books/content?id=yjo0BgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc8e"},"cities":["medellin","cartagena"],"hasDigitalCopy":true,"copies":[927,300],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b027cfbc2da4fddc8f"},"isbn":9.780451208637e+12,"title":"the divine comedy","author":"dante alighieri","year":2003,"description":"Dante Alighieri's poetic masterpiece, The Divine Comedy, is a moving human drama, an unforgettable visionary journey through the infinite torment of Hell, up the arduous slopes of Purgatory, and on to the glorious realm of Paradise—the sphere of universal harmony and eternal salvation. 10 illustrations @HolyHaha I have to climb a mountain now? You got to be kidding me. Is this a joke? Who the hell came up with story? VIIIRRRGGGILLLLLLLLLLL! From Twitterature: The World's Greatest Books in Twenty Tweets or Less","numPages":895,"image":"http://books.google.com/books/content?id=gohkAAAAMAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc90"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[341,512,241,665,501,131,182],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b027cfbc2da4fddc91"},"isbn":9.780321928429e+12,"title":"c primer plus","author":"stephen prata","year":2014,"description":"Explains fundamental programming concepts, including structured code and top-down design.","numPages":1037,"image":"http://books.google.com/books/content?id=uzQ0AgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc92"},"cities":["medellin","quito"],"hasDigitalCopy":true,"copies":[639,757,976,1041,990,323,1019,1036],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc93"},"isbn":9.780345325815e+12,"title":"the silmarillion","author":"john ronald reuel tolkien","year":1999,"description":"Tales and legends chronicling the world's beginnings and the happenings of the First Age set the stage for Tolkien's other classic works and focus on the theft of the Elves' jewels by Morgoth, first dark Lord of Middle-earth. Reissue.","numPages":458,"image":"http://books.google.com/books/content?id=pVLBvQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc94"},"cities":["cartagena"],"hasDigitalCopy":false,"copies":[1051,212,111,443],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddc95"},"isbn":9.780545790352e+12,"title":"harry potter and the sorcerer's stone","author":"j. k. rowling","year":2015,"description":"Rescued from the outrageous neglect of his aunt and uncle, a young boy with a great destiny proves his worth while attending Hogwarts School for Witchcraft and Wizardry.","numPages":256,"image":"http://books.google.com/books/content?id=gqX7rQEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc96"},"cities":["quito"],"hasDigitalCopy":false,"copies":[1015,870],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc97"},"isbn":9.780547928227e+12,"title":"the hobbit, or, there and back again","author":"j. r. r. tolkien","year":2012,"description":"Celebrating 75 years of one of the world's most treasured classics with an all new trade paperback edition. Repackaged with new cover art. 500,000 first printing.","numPages":300,"image":"http://books.google.com/books/content?id=LLSpngEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc98"},"cities":["medellin"],"hasDigitalCopy":true,"copies":[382,911,264,775],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc99"},"isbn":9.780140268867e+12,"title":"the odyssey","author":"homer","year":1997,"description":"A new translation of the epic poem retells the story of Odysseus's ten-year voyage home to Ithaca after the Trojan War","numPages":541,"image":"http://books.google.com/books/content?id=gVK5kYT0qFcC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc9a"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[993,907,351,918,1094,630,317,835,361],"bookinfo":{"rating":4.5,"_id":{"$oid":"5c0927b027cfbc2da4fddc9b"},"isbn":9.781501175466e+12,"title":"it","author":"stephen king","year":2017,"description":"It began -- and ended -- in 1958 when seven children searched in the drains beneath Derry for an evil creature, but in 1985, Mike, once one of those children, makes six phone calls and disinters an unremembered promise that sets off the ultimate terror.","numPages":1184,"image":"http://books.google.com/books/content?id=KiszDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc9c"},"cities":["quito"],"hasDigitalCopy":true,"copies":[360,535,918],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc9d"},"isbn":9.780425274866e+12,"title":"big little lies","author":"liane moriarty","year":2015,"description":"The new novel from the author of The Husband's Secret A #1 New York Times Bestseller Sometimes it's the little lies that turn out to be the most lethal. A murder...A tragic accident...Or just parents behaving badly? What's indisputable is that someone is dead. Madeline is a force to be reckoned with. She's funny, biting, and passionate; she remembers everything and forgives no one. Celeste is the kind of beautiful woman who makes the world stop and stare but she is paying a price for the illusion of perfection. New to town, single mom Jane is so young that another mother mistakes her for a nanny. She comes with a mysterious past and a sadness beyond her years. These three women are at different crossroads, but they will all wind up in the same shocking place. Big Little Lies is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive.","numPages":512,"image":"http://books.google.com/books/content?id=QNQBDAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddc9e"},"cities":["medellin"],"hasDigitalCopy":false,"copies":[310,909,204,426,578,256,761,679],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddc9f"},"isbn":9.780142437544e+12,"title":"the portable dante","author":"dante alighieri","year":2003,"description":"Includes \"The Divine Comedy,\" \"The New Life,\" and other selected poems, prose, and letters accompanied by biographical and introductory sections.","numPages":654,"image":"http://books.google.com/books/content?id=GlJo4h4KEPQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddca0"},"cities":["medellin"],"hasDigitalCopy":true,"copies":[227,805,557,705,796,1099,816,398,117],"bookinfo":{"rating":4,"_id":{"$oid":"5c0927b027cfbc2da4fddca1"},"isbn":9.780060652937e+12,"title":"the screwtape letters","author":"c. s. lewis","year":2001,"description":"In this humorous and perceptive exchange between two devils, C. S. Lewis delves into moral questions about good vs. evil, temptation, repentance, and grace. Through this wonderful tale, the reader emerges with a better understanding of what it means to live a faithful life.","numPages":224,"image":"http://books.google.com/books/content?id=g2ayrK1Y9xsC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddca2"},"cities":["cartagena"],"hasDigitalCopy":true,"copies":[399,1009,1080,937,502,735,281,248,942,1013],"bookinfo":{"rating":-1,"_id":{"$oid":"5c0927b027cfbc2da4fddca3"},"isbn":9.780674504868e+12,"title":"dante","author":"marco santagata","year":2016,"description":"A Times Literary Supplement Book of the Year A Marginal Revolution Best Non-Fiction Book of the Year A Seminary Co-op Notable Book of the Year A Times Higher Education Book of the Week A Choice Outstanding Academic Title of the Year Marco Santagata’s Dante: The Story of His Life illuminates one of the world’s supreme poets from many angles—writer, philosopher, father, courtier, political partisan. Santagata brings together a vast body of Italian scholarship on Dante’s medieval world, untangles a complex web of family and political relationships for English readers, and shows how the composition of the Commedia was influenced by local and regional politics. “Reading Marco Santagata’s fascinating new biography, the reader is soon forced to acknowledge that one of the cornerstones of Western literature [The Divine Comedy], a poem considered sublime and universal, is the product of vicious factionalism and packed with local scandal.” —Tim Parks, London Review of Books “This is a wonderful book. Even if you have not read Dante you will be gripped by its account of one of the most extraordinary figures in the history of literature, and one of the most dramatic periods of European history. If you are a Dantean, it will be your invaluable companion forever.” —A. N. Wilson, The Spectator","numPages":485,"image":"http://books.google.com/books/content?id=PSa7CwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddca4"},"cities":["quito"],"hasDigitalCopy":true,"copies":[271],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b027cfbc2da4fddca5"},"isbn":9.780547928203e+12,"title":"the lord of the rings","author":"john ronald reuel tolkien","year":1954,"description":"Presents a boxed set including the complete \"Lord of the Rings\" trilogy, as well as its prequel, \"The Hobbit.\"","numPages":725,"image":"http://books.google.com/books/content?id=rns7uwEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b027cfbc2da4fddca6"},"cities":["medellin"],"hasDigitalCopy":false,"copies":[779,523,529,962],"bookinfo":{"rating":3,"_id":{"$oid":"5c0927b027cfbc2da4fddca7"},"isbn":9.780321563842e+12,"title":"the c++ programming language","author":"bjarne stroustrup","year":2013,"description":"C++11 has arrived: thoroughly master it, with the definitive new guide from C++ creator Bjarne Stroustrup, C++ Programming Language, Fourth Edition! The brand-new edition of the world's most trusted and widely read guide to C++, it has been comprehensively updated for the long-awaited C++11 standard. Extensively rewritten to present the C++11 language, standard library, and key design techniques as an integrated whole, Stroustrup thoroughly addresses changes that make C++11 feel like a whole new language, offering definitive guidance for leveraging its improvements in performance, reliability, and clarity. C++ programmers around the world recognize Bjarne Stoustrup as the go-to expert for the absolutely authoritative and exceptionally useful information they need to write outstanding C++ programs. Now, as C++11 compilers arrive and development organizations migrate to the new standard, they know exactly where to turn once more: Stoustrup's C++ Programming Language, Fourth Edition.","numPages":1361,"image":"http://books.google.com/books/content?id=L6MPBQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
{"_id":{"$oid":"5c0927b127cfbc2da4fddcaa"},"cities":["quito","cartagena"],"hasDigitalCopy":true,"copies":[607,678,163,502],"bookinfo":{"rating":5,"_id":{"$oid":"5c0927b127cfbc2da4fddcab"},"isbn":9.781491962299e+12,"title":"hands-on machine learning with scikit-learn and tensorflow","author":"aurélien géron","year":2017,"description":"Through a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This practical book shows you how. By using concrete examples, minimal theory, and two production-ready Python frameworks—scikit-learn and TensorFlow—author Aur�lien G�ron helps you gain an intuitive understanding of the concepts and tools for building intelligent systems. You’ll learn a range of techniques, starting with simple linear regression and progressing to deep neural networks. With exercises in each chapter to help you apply what you’ve learned, all you need is programming experience to get started. Explore the machine learning landscape, particularly neural nets Use scikit-learn to track an example machine-learning project end-to-end Explore several training models, including support vector machines, decision trees, random forests, and ensemble methods Use the TensorFlow library to build and train neural nets Dive into neural net architectures, including convolutional nets, recurrent nets, and deep reinforcement learning Learn techniques for training and scaling deep neural nets Apply practical code examples without acquiring excessive machine learning theory or algorithm details","numPages":566,"image":"http://books.google.com/books/content?id=I6qkDAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api"},"lends":[],"__v":0}
