{
  "books": [
    {
      "title": "All the Light We Cannot See",
      "author": "Anthony Doerr",
      "year": "2017",
      "description": "From the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and German boy whose paths collide in occupied France as both try to survive devastation of Word War II.",
      "numPages": 544,
      "rating": 4,
      "image": "http://books.google.com/books/content?id=giaLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "Euphoria",
      "author": "Lily King",
      "year": "2015",
      "description": "English anthropologist Andrew Banson has been alone in the field for several years, studying the Kiona river tribe in 1930s New Guinea. Haunted by the memory of his brothers' deaths and increasingly frustrated and isolated by his research, Bankson is on the verge of suicide. Then he encounters the famous and controversial American anthropologist Nell Stone and her wry and mercurial Australian husband, Fen, who have just fled the bloodthirsty Mumbanyo. Nell and Fen and, in spite of Nell's poor health, are hungry for a new discovery. When Bankson finds them a new tribe nearby, the artistic, female-dominated Tam, he ignites an intellectual and romantic firestorm between the three of them that burns out of anyone's control.",
      "numPages": 288,
      "rating": 4,
      "image": "http://books.google.com/books/content?id=5ry-oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
      "title": "Black Swan Green",
      "author": "David Mitchell",
      "year": "2007",
      "description": "A meditative novel of a young boy on the cusp of adulthood follows a single year in the life of thirteen-year-old Jason Taylor as he grows up in what is for him the sleepiest village in Worcestershire, England, in 1982. By the aauthor of Cloud Atlas. Reprint. 75,000 first printing.",
      "numPages": 294,
      "rating":4,
      "image": "http://books.google.com/books/content?id=deDTTheTbPsC&printsec=frontcover&img=1&zoom=1&source=gbs_api"
    },
    {
      "title": "Revival",
      "author": "Stephen King",
      "year": "2015",
      "description": "The new minister came to Harlow, Maine, when Jamie Morton was a boy doing a battle with his toy army men on the front lawn. The young Reverend Charles Jacobs and his beautiful wife brought new life to the local church and captivated their congregation. But with Jamie, he shares a secret obsession - a draw so powerful, it would have profound consequences five decades after the shattering tragedy that turned the preacher against God, and long after his final, scathing sermon. Now Jamie, a nomadic rock guitarist hooked on heroin, meets Charles Jacobs again. And when their bond becomes a pact beyond even the Devil's devising, Jamie discovers that revival has many meanings.",
      "numPages": 416,
      "rating":3.5,
      "image": "http://books.google.com/books/content?id=VLW2CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "title": "It",
      "author": "Stephen King",
      "year": "2015",
      "description": "It began in 1958 when seven children searched in the drains beneath Derry for an evil creature, but in 1985, Mike, once one of those children, makes six phone calls and disinters an unremembered promise that sets off the ultimate terror.",
      "numPages": 1184,
      "rating":4.5,
      "image": "http://books.google.com/books/content?id=KiszDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  ]
}