{"books":[{"title":"All the Light We Cannot See","author":"Anthony Doerr","year":"2017","description":"From the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and German boy whose paths collide in occupied France as both try to survive devastation of Word War II.","numPages":544,"rating":4,"image":"http://books.google.com/books/content?id=giaLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"Euphoria","author":"Lily King","year":"2015","description":"English anthropologist Andrew Banson has been alone in the field for several years, studying the Kiona river tribe in 1930s New Guinea. Haunted by the memory of his brothers' deaths and increasingly frustrated and isolated by his research, Bankson is on the verge of suicide. Then he encounters the famous and controversial American anthropologist Nell Stone and her wry and mercurial Australian husband, Fen, who have just fled the bloodthirsty Mumbanyo. Nell and Fen and, in spite of Nell's poor health, are hungry for a new discovery. When Bankson finds them a new tribe nearby, the artistic, female-dominated Tam, he ignites an intellectual and romantic firestorm between the three of them that burns out of anyone's control.","numPages":288,"rating":4,"image":"http://books.google.com/books/content?id=5ry-oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Black Swan Green","author":"David Mitchell","year":"2007","description":"A meditative novel of a young boy on the cusp of adulthood follows a single year in the life of thirteen-year-old Jason Taylor as he grows up in what is for him the sleepiest village in Worcestershire, England, in 1982. By the aauthor of Cloud Atlas. Reprint. 75,000 first printing.","numPages":294,"rating":4,"image":"http://books.google.com/books/content?id=deDTTheTbPsC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Revival","author":"Stephen King","year":"2015","description":"The new minister came to Harlow, Maine, when Jamie Morton was a boy doing a battle with his toy army men on the front lawn. The young Reverend Charles Jacobs and his beautiful wife brought new life to the local church and captivated their congregation. But with Jamie, he shares a secret obsession - a draw so powerful, it would have profound consequences five decades after the shattering tragedy that turned the preacher against God, and long after his final, scathing sermon. Now Jamie, a nomadic rock guitarist hooked on heroin, meets Charles Jacobs again. And when their bond becomes a pact beyond even the Devil's devising, Jamie discovers that revival has many meanings.","numPages":416,"rating":3.5,"image":"http://books.google.com/books/content?id=VLW2CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"It","author":"Stephen King","year":"2015","description":"It began in 1958 when seven children searched in the drains beneath Derry for an evil creature, but in 1985, Mike, once one of those children, makes six phone calls and disinters an unremembered promise that sets off the ultimate terror.","numPages":1184,"rating":4.5,"image":"http://books.google.com/books/content?id=KiszDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"},{"title":"This Is How It Always Is","author":"Laurie Frankel","year":"2018","description":"The Reese Witherspoon x Hello Sunshine Book Club Pick “Every once in a while, I read a book that opens my eyes in a way I never expected.” —Reese Witherspoon (Reese’s Book Club x Hello Sunshine book pick) People Magazine’s Top 10 Books of 2017 Amazon’s Best Books of 2017: Top 20 Amazon’s Best Literature and Fiction of 2017 Bustle’s 17 Books Every Woman Should Read From 2017 PopSugar’s Our Favorite Books of the Year (So Far) Refinery29's Best Books of the Year So Far BookBrowse’s The 20 Best Books of 2017 Pacific Northwest Book Awards Finalist The Globe and Mail's Top 100 Books of 2017 “It made me laugh, it made me cry, it made me think.” —Liane Moriarty, #1 New York Times bestselling author of Big Little Lies This is how a family keeps a secret...and how that secret ends up keeping them. This is how a family lives happily ever after...until happily ever after becomes complicated. This is how children change...and then change the world. This is Claude. He’s five years old, the youngest of five brothers, and loves peanut butter sandwiches. He also loves wearing a dress, and dreams of being a princess. When he grows up, Claude says, he wants to be a girl. Rosie and Penn want Claude to be whoever Claude wants to be. They’re just not sure they’re ready to share that with the world. Soon the entire family is keeping Claude’s secret. Until one day it explodes. Laurie Frankel's This Is How It Always Is is a novel about revelations, transformations, fairy tales, and family. And it’s about the ways this is how it always is: Change is always hard and miraculous and hard again, parenting is always a leap into the unknown with crossed fingers and full hearts, children grow but not always according to plan. And families with secrets don’t get to keep them forever.","numPages":336,"rating":4.5,"image":"http://books.google.com/books/content?id=AoiNAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Station Eleven","author":"Emily St. John Mandel","year":"2015","description":"A National Book Award Finalist A PEN/Faulkner Award Finalist Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end. Twenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band's existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed.","numPages":352,"rating":4,"image":"http://books.google.com/books/content?id=AQzRrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Big Little Lies","author":"Liane Moriarty","year":"2015","description":"The new novel from the author of The Husband's Secret A #1 New York Times Bestseller Sometimes it's the little lies that turn out to be the most lethal. A murder...A tragic accident...Or just parents behaving badly? What's indisputable is that someone is dead. Madeline is a force to be reckoned with. She's funny, biting, and passionate; she remembers everything and forgives no one. Celeste is the kind of beautiful woman who makes the world stop and stare but she is paying a price for the illusion of perfection. New to town, single mom Jane is so young that another mother mistakes her for a nanny. She comes with a mysterious past and a sadness beyond her years. These three women are at different crossroads, but they will all wind up in the same shocking place. Big Little Lies is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive.","numPages":512,"rating":4,"image":"http://books.google.com/books/content?id=QNQBDAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Savage Harvest","author":"Carl Hoffman","year":"2015","description":"On November 21, 1961, Michael C. Rockefeller, the twenty-three-year-old son of New York governor Nelson Rockefeller, vanished off the coast of southwest New Guinea when his boat capsized. He was on a collecting expedition for the Museum of Primitive Art, and his partner—who stayed with the boat and was later rescued—shared Michael's final words as he swam for help: \"I think I can make it.\" Despite exhaustive searches, no trace of Michael was ever found. Soon after his disappearance, rumors surfaced that he'd made it to shore, where he was then killed and eaten by the local Asmat—a native tribe of warriors whose complex culture was built around sacred, reciprocal violence, headhunting, and ritual cannibalism. The Dutch government and the Rockefeller family vehemently denied the story, and Michael's death was officially ruled a drowning. But doubts lingered and sensational stories circulated, fueling speculation and intrigue for decades. Now, award-winning journalist Carl Hoffman reveals startling new evidence that finally tells the full, astonishing story. Retracing Michael's steps, Hoffman traveled to the jungles of New Guinea, immersing himself in a world of former headhunters and cannibals, secret spirits and customs, and getting to know generations of Asmat. Through exhaustive archival research, he uncovered hundreds of pages of never-before-seen original documents and located witnesses willing to speak publicly for the first time in fifty years. Savage Harvest is at once a mesmerizing whodunit and a fascinating portrait of the clash between two civilizations that resulted in the death of one of America's richest and most powerful scions.","numPages":336,"rating":3.5,"image":"http://books.google.com/books/content?id=0E2NoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Fingersmith","author":"Sarah Waters","year":"2002","description":"Growing up as a foster child among a family of thieves, orphan Sue Trinder hopes to pay back that kindness by playing a key role in a swindle scheme devised by their leader, Gentleman, who is planning to con a fortune out of the naive Maud Lily, but Sue's growing pity for their helpless victim could destroy the plot. By the author of Tipping the Velvet. Reprint.","numPages":582,"rating":4,"image":"http://books.google.com/books/content?id=FWqVsyz7TuUC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Lord of the Rings","author":"John Ronald Reuel Tolkien","year":"2012","description":"Presents a boxed set including the complete \"Lord of the Rings\" trilogy, as well as its prequel, \"The Hobbit.\"","numPages":398,"rating":5,"image":"http://books.google.com/books/content?id=h9k1uwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Lord of the Rings","author":"John Ronald Reuel Tolkien","year":"1954","description":"Presents a boxed set including the complete \"Lord of the Rings\" trilogy, as well as its prequel, \"The Hobbit.\"","numPages":725,"rating":5,"image":"http://books.google.com/books/content?id=rns7uwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Beren and Luthien","author":"J. R. R. Tolkien","year":"2017","description":"Painstakingly restored from Tolkien's manuscripts and presented for the first time as a continuous and standalone story, the epic tale of Beren and Luthien will reunite fans of The Hobbit and The Lord of the Rings with Elves and Men, along with the rich landscape and creatures unique to Tolkien's Middle-earth. Edited by Christopher Tolkien with cover art, drawings, and color plates by Alan Lee.","numPages":288,"image":"http://books.google.com/books/content?id=Ak8VvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"The Silmarillion","author":"J. R. John Ronald Reuel Tolkien","year":"1979","description":"Tales and legends chronicling the world's beginnings and the happenings of the First Age set the stage for Tolkien's other classic works and focus on the theft of the Elves' jewels by Morgoth, first dark Lord of Middle-earth. Reissue.","numPages":458,"rating":4,"image":"http://books.google.com/books/content?id=uFKaXu23ovoC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Children of Húrin","author":"John Ronald Reuel Tolkien","year":"2007","description":"A fantasy adventure saga set in the early days of Middle-Earth features humans and elves, dwarves and dragons, orcs and dark sorcerers clashing in an epic battle between good and evil.","numPages":313,"rating":4,"image":"http://books.google.com/books/content?id=wnVlAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Edgar Allan Poe Complete Tales and Poems","author":"Edgar Allan Poe","year":"2009","description":"The life of American writer Edgar Allan Poe was characterized by a dramatic series of successes and failures, breakdowns and recoveries, personal gains and hopes dashed through, despite which he created some of the finest literature the world has ever known. Over time his works have influenced such major creative forces as the French poets Charles Baudelaire and Andre Gide, filmmaker D.W. Griffith and modern literary legend Allen Ginsberg. Best known for his poems and short fiction, Poe perfected the psychological thriller, invented the detective story, and rarely missed transporting the reader to his own supernatural realm. He has also been hailed posthumously as one of the finest literary critics of the nineteenth century. In Edgar Allan Poe: Complete Tales and Poems fans may indulge in all of Poe's most imaginative short-stories, including The Fall of the House of Usher, The Murders in Rue Morgue, The Tell-Tale Heart, Ligeia and Ms. In a Bottle. His complete early and miscellaneous poetic masterpieces are here also, including The Raven, Ulalume, Annabel Lee, Tamerlane, as well as select reviews and narratives.","numPages":842,"rating":4,"image":"http://books.google.com/books/content?id=uY4NAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"Poe Coloring Book","author":"Odessa Begay","year":"2016","description":"Dive into the macabre, mysterious world of Edgar Allan Poe's chilling tales with popular coloring book artist Odessa Begay (Little Birds). Inspired by Poe's beloved stories, Begay has created images that reference settings, motifs, and details that fans will recognize.","numPages":96,"image":"http://books.google.com/books/content?id=RURljwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"El túnel","author":"Ernesto Sabato","year":"2003","description":"Juan Pablo Castel es un pintor recluido en prisión por el asesinato de María Iribarne.","numPages":160,"rating":4,"image":"http://books.google.com/books/content?id=qHiT2Ys_JxwC&printsec=frontcover&img=1&zoom=1&source=gbs_api"},{"title":"One Hundred Years of Solitude","author":"Gabriel Garcia Marquez","year":"2006","description":"One Hundred Years of Solitude tells the story of the rise and fall, birth and death of the mythical town of Macondo through the history of the Buendía family. Inventive, amusing, magnetic, sad, and alive with unforgettable men and women -- brimming with truth, compassion, and a lyrical magic that strikes the soul -- this novel is a masterpiece in the art of fiction.","numPages":448,"rating":3.5,"image":"http://books.google.com/books/content?id=Rtk8PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}]}